<template>
  <v-row no-gutters justify="center" class="mt-12">
	  <v-card class="mt-12 cols-12" max-width="80vw">
		  <v-card-title>This is an about page</v-card-title>
		  <v-divider/>
		  <v-card-text>
			  Привет, коллеги!
			  <br><br>
			  В данном тестовом задании я постарался охватить максимальное количество инструментов и подходов к разработке,
			  с целью показать уровень владения ими, в результате чего код получился разношерстным
			  и без единого стиля.

			  <br><br>
			  Использовано:

			  <br>
			  <span class="subtitle-1">
				  Vue, Vue-Composition API, Vue-Router, Vuex, Vuetify, CssGrid, SASS/SCSS, JavaScript es@next, TypeScript, LocalStorage
			  </span>

			  <br>
			  Пожелание написать весь код на TS дошло ко мне уже после написания 80% функционала, поэтому доделал кусками что смог,
			  и естественно получилось криво.

			  <br>
			  Однако все работает! :)

			  <br><br>
			  Для основного функционала использовался vue composition api, в компоненте masterArea.vue, в частности,
			  реализован поиск и сортировка на основе использования расширяемых чистых функций,
			  в тождественном компоненте - slaveArea.vue, использован классический подход на основе Vue.filters

			  <br>
			  Конечно можно было бы упихать фильтры в Array.prototype или в методы класса - но так не интересно.

			  <br><br>
			  При использовании Vue Composition Api, во Vuex нет смысла держать что либо не являющееся частью состояния приложения,
			  однако чтобы не плодить сущностей и сократить время, в этом задании, напихал все в один модуль.

			  <br><br>
			  Данной задание выполнялось в жестком ограничении по времени, поэтому кое-что сделано ... не очень, но так как к основному
			  функционалу не относится, оставил как есть.

			  <br><br>
			  Алгоритм поиска работает быстро, однако компоненты в DOM отрисовываются тяжело. Но насколько я понял, задачи
			  оптимизации скорости отрисовки списков не стояло, и я не стал заморачиваться.
			  <br><br>
			  P.S.: немного таки заморочился и набросал virtual-scroller для быстрой отрисовки массива элементов.
			  <br> На 500.000 элементов - все летает.

			  <br>
			  Скроллер сделан максимально просто, div ы не перерисовываются при скроллировании, сверху добавляю паддинг и усе.
		  </v-card-text>
		  <v-divider/>
		  <v-card-actions>
			  <v-spacer/>
			  <v-btn @click="$router.push('/')" text>
				  Close
			  </v-btn>
		  </v-card-actions>
	  </v-card>
  </v-row>
</template>
